InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиЭлектронногоОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресОбщегоКаталогаНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКОбщемуКаталогуНаВебСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбщийКаталогВТонкомКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьВОбщемКаталогеМанифестCMI5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Значение(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки."+ИмяНастройки+" КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.ОбщиеНастройкиЭлектронногоОбучения КАК Настройки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		РеквизитРегистра = Метаданные.РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Ресурсы.Найти(ИмяНастройки);
		
		Если РеквизитРегистра = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Ошибочное имя общих настроек электронного обучения'");
		КонецЕсли;
		
		Возврат РеквизитРегистра.Тип.ПривестиЗначение(Неопределено);
		
	Иначе		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		Возврат ВыборкаДетальныеЗаписи.ЗначениеНастройки;	
		
	КонецЕсли;
		
КонецФункции

Процедура Сохранить(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи[ИмяНастройки] = ЗначениеНастройки;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОбщийКаталогНастроен(Знач АдресОбщегоКаталога = Неопределено, Знач ПутьКОбщемуКаталогу = Неопределено) Экспорт
	
	Если АдресОбщегоКаталога = Неопределено
		ИЛИ ПутьКОбщемуКаталогу = Неопределено Тогда
		
		АдресОбщегоКаталога = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("АдресОбщегоКаталогаНаВебСервере");
		ПутьКОбщемуКаталогу = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("ПутьКОбщемуКаталогуНаВебСервере");
		
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(АдресОбщегоКаталога) И ЗначениеЗаполнено(ПутьКОбщемуКаталогу), Истина, Ложь)
	
КонецФункции

#КонецОбласти

#КонецЕсли
